The air terminal cannot be placed in an elevation or section view unless it is attached to a duct.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CantPlaceATOnDuctError { get; }
  Visual Basic
Public Shared ReadOnly Property CantPlaceATOnDuctError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CantPlaceATOnDuctError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace